using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

public class NonLinearKontur : Kontur
{
    List<string> methodName = new List<string>() {"Курсовая маска (Север)","Метод двух разностей",
            "Оператор Кирша","Курсовая маска (Северо-Запад)","Оператор Собела (1)","Курсовая маска (Северо-Восток)",
            "Оператор Лапласа (Н13)","Курсовая маска (Юг)","Оператор Робертса (2)","Курсовая маска (Юго-Запад)",
            "Метод разностей по столбцам","Курсовая маска (Юго-Восток)","Метод разностей по строкам",
            "Оператор Лапласа (Н14)","Курсовая маска (Восток)","Оператор Лапласа (Н15)","Оператор Собела (2)",
            "Курсовая маска (Запад)","Оператор Уоллиса","Оператор Робертса (1)","Оператор Превитта","Оператор Шарра",
            "Оператор Робинсона"};
}
